app/controllers/api/sessions_controller.rb

  def create
    @user = User.find_by_credentials(
      params[:user][:email],
      params[:user][:password]
    )
    if @user
      login(@user)
      render 'api/users/show'
    else
      if (params[:user][:email].length < 1 || params[:user][:email].length < 1)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Email address"], ["LIMIT", 1]]