app/controllers/api/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all #Video.all.include(s)(:likes).include(:comments)

INSERT INTO "videos" ("title", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Black Coast"], ["owner_id", 1], ["created_at", "2019-11-13 23:13:38.228351"], ["updated_at", "2019-11-13 23:13:38.228351"]]
SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @video = Video.new(video_params)
    if @video.save
      @video = Video.last