app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "C0dY7LHTV8dXdhln84Eb7Q"], ["LIMIT", 1]]
---
  def current_user
    return nil if (session[:session_token] == nil)
    @current_user ||= User.find_by(session_token: session[:session_token])