app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "C0dY7LHTV8dXdhln84Eb7Q"], ["updated_at", "2019-11-08 18:11:52.119797"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = unique_session_token
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "pwyr_OkPBkiftgqJPfUe9Q"], ["LIMIT", 1]]
---
  def unique_session_token
    random_token = random_session_token
    while (User.find_by(session_token: random_token))